fio/test_suite_sd_results/bs8k_read20write80.txt
bs8k_read20write80: (g=0): rw=randrw, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=psync, iodepth=1
...
fio-3.33
Starting 4 processes
bs8k_read20write80: Laying out IO file (1 file / 100MiB)
bs8k_read20write80: Laying out IO file (1 file / 100MiB)
bs8k_read20write80: Laying out IO file (1 file / 100MiB)
[...]

bs8k_read20write80: (groupid=0, jobs=4): err= 0: pid=3305: Sun Jun  8 21:30:55 2025
  read: IOPS=78, BW=626KiB/s (641kB/s)(21.0MiB/34379msec)
    clat (usec): min=1442, max=1302.3k, avg=32730.26, stdev=118230.35
     lat (usec): min=1442, max=1302.3k, avg=32730.85, stdev=118230.46
    clat percentiles (msec):
     |  1.00th=[    4],  5.00th=[    4], 10.00th=[    4], 20.00th=[    4],
     | 30.00th=[    5], 40.00th=[    5], 50.00th=[    5], 60.00th=[    5],
     | 70.00th=[    5], 80.00th=[    5], 90.00th=[   89], 95.00th=[  194],
     | 99.00th=[  489], 99.50th=[ 1217], 99.90th=[ 1301], 99.95th=[ 1301],
     | 99.99th=[ 1301]
   bw (  KiB/s): min=   60, max= 7584, per=100.00%, avg=1094.90, stdev=590.50, samples=157
   iops        : min=    4, max=  948, avg=134.61, stdev=74.04, samples=157
  write: IOPS=325, BW=2603KiB/s (2665kB/s)(87.4MiB/34379msec); 0 zone resets
    clat (usec): min=15, max=5791.9k, avg=4408.09, stdev=140395.92
     lat (usec): min=16, max=5791.9k, avg=4408.90, stdev=140396.02
    clat percentiles (usec):
     |  1.00th=[     17],  5.00th=[     17], 10.00th=[     17],
     | 20.00th=[     18], 30.00th=[     18], 40.00th=[     19],
     | 50.00th=[     20], 60.00th=[     24], 70.00th=[     34],
     | 80.00th=[     40], 90.00th=[     49], 95.00th=[     63],
     | 99.00th=[    128], 99.50th=[    149], 99.90th=[2499806],
     | 99.95th=[3909092], 99.99th=[5804917]
   bw (  KiB/s): min=   92, max=34656, per=100.00%, avg=4938.17, stdev=2525.72, samples=145
   iops        : min=    8, max= 4332, avg=615.13, stdev=315.94, samples=145
  lat (usec)   : 20=44.06%, 50=29.37%, 100=6.02%, 250=0.95%, 500=0.02%
  lat (usec)   : 750=0.06%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=4.75%, 10=12.39%, 100=0.45%, 250=1.49%
  lat (msec)   : 500=0.17%, 750=0.03%, 1000=0.03%, 2000=0.12%, >=2000=0.09%
  cpu          : usr=0.11%, sys=0.37%, ctx=3108, majf=0, minf=121
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=2692,11185,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=626KiB/s (641kB/s), 626KiB/s-626KiB/s (641kB/s-641kB/s), io=21.0MiB (22.1MB), run=34379-34379msec
  WRITE: bw=2603KiB/s (2665kB/s), 2603KiB/s-2603KiB/s (2665kB/s-2665kB/s), io=87.4MiB (91.6MB), run=34379-34379msec

Disk stats (read/write):
  mmcblk0: ios=2692/2239, merge=0/6, ticks=73093/3692141, in_queue=3765234, util=95.04%